Revit 2024 API
ParameterTypeId.ElemRoomName Property
 "Room Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ElemRoomName { get; }
Visual Basic
Public Shared ReadOnly Property ElemRoomName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElemRoomName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace